// @ts-ignore
// noinspection JSNonASCIINames

const is = (...x) => 音韻地位.屬於(...x);
// @ts-ignore
const when = (...x) => 音韻地位.判斷(...x);

// @ts-ignore
if (!音韻地位) {
  // noinspection JSAnnotator
  return [
    ["標調方式", [1, "數字（默認）", "附標", "不標", "五度"]],
    ["拼式版本", [1, "優化（默認）", "原始", "注音", "拼音", "音位", "音值"]],
  ];
}

// if (is`明母 尤東韻`) 音韻地位 = 音韻地位.調整('${音韻地位.韻 === "尤" ? "侯" : 音韻地位.韻}韻 一等 不分類');
if (is("云母 通攝 舒聲")) {
  // @ts-ignore
  音韻地位 = 音韻地位.調整("匣母", ["匣母三等"]);
}

function getInitial() {
  return when([
    [
      "幫母",
      [
        ["C類", "f"],
        ["", "b"],
      ],
    ],
    [
      "滂母",
      [
        ["C類", "f"],
        ["", "p"],
      ],
    ],
    [
      "並母",
      [
        ["C類", "f"],
        ["平聲", "p"],
        ["", "b"],
      ],
    ],
    [
      "明母",
      [
        ["C類", "v"],
        ["", "m"],
      ],
    ],

    ["端母", "d"],
    ["透母", "t"],
    [
      "定母",
      [
        ["平聲", "t"],
        ["", "d"],
      ],
    ],
    ["泥母", "n"],

    ["孃母", "nj"],
    ["來母", "l"],

    ["精母", "tz"],
    ["清母", "ts"],
    [
      "從母",
      [
        ["平聲", "ts"],
        ["", "tz"],
      ],
    ],
    ["心邪母", "s"],

    ["知莊章母", "zh"],
    ["徹初昌母", "ch"],
    [
      "澄崇母",
      [
        ["平聲", "ch"],
        ["", "zh"],
      ],
    ],
    [
      "常母",
      [
        ["平聲", "ch"],
        ["", "sh"],
      ],
    ],
    ["生書俟船母", "sh"],
    ["日母", "r"],

    ["見母", "g"],
    ["溪母", "k"],
    [
      "羣母",
      [
        ["平聲", "k"],
        ["", "g"],
      ],
    ],
    ["曉匣母", "h"],
    ["疑母", "ng"],

    ["以母 蟹攝 三四等 合口", "r"], //「銳」
    ["影云以母", ""],
  ]);
}

function format(obj) {
  if (typeof obj != "object" || obj == null) {
    return obj;
  }
  return Object.entries(obj).map(([key, value]) => {
    if (typeof value == "object" && value != null) {
      return [key, format(value)];
    } else {
      return [key, value];
    }
  });
}

function getFinal() {
  const 捲舌 = "莊章組 或 知徹澄日母";
  return when(
    format({
      舒聲: {
        通攝: {
          一等: "ung",
          三等: { "幫組 或 影母": "ung", [捲舌]: "ung", "": "iung" },
        },
        江攝: { "幫組": "ang", [捲舌]: "uang", "": "iang" },
        止攝: {
          幫組: { "B類": "ei", "": "i" },
          開口: { "精組": "z", "莊章組": "r", "知徹澄母": "ee", "日母": "er", "": "i" },
          合口: { "幫組": "i", "莊組": "uai", "": "uei" },
        },
        遇攝: {
          魚韻: { "章組 或 知徹澄日母": "yu", "莊組": "u", "": "io" },
          虞韻: { [`${捲舌} 或 幫組`]: "u", "": "yu" },
          模韻: "u",
        },
        蟹攝: {
          齊祭韻: {
            "開口 或 幫組": { "莊組": "r", "": "i" },
            "合口": { "": "uei" },
          },
          泰韻: { "幫組": "uei", "開口 或 精組": "ai", "合口": "oi" },
          佳韻: {
            "開口 或 幫組": { "見影組 或 孃母": "iai", "": "ai" },
            "合口": { "見影組 或 孃母": "ua", "": "uai" },
          },
          皆夬韻: {
            "開口 或 幫組": { "見影組 或 孃母": "iai", "": "ai" },
            "合口": "uai",
          },
          咍韻: { "精組": "ai", "": "oi" },
          灰韻: "uei",
          廢韻: { 幫組: "i", 開口: "ei", 合口: "uei" },
        },
        臻攝: {
          真韻: {
            "開口 或 幫組": { [捲舌]: "en", "": "in" },
            "合口": { [捲舌]: "uen", "": "yun" },
          },
          臻殷韻: { [捲舌]: "en", "": "in" },
          文韻: { "幫組": "en", "": "yun" },
          痕韻: "en",
          魂韻: "uen", // 有異讀
        },
        山攝: {
          寒韻: {
            "開口": "an",
            "合口 或 幫組": { "幫端精組 或 來母": "uan", "": "uon" },
          },
          刪山韻: {
            "開口 或 幫組": { "見影組 或 孃母": "ien", "": "an" },
            "合口": "uan",
          },
          元韻: {
            "開口": "ien",
            "合口 或 幫組": { "幫組": "an", "": "yuen" },
          },
          先韻: {
            "開口 或 幫組": "ien",
            "合口": { [捲舌]: "uen", "": "yuen" },
          },
          仙韻: {
            "開口 或 幫組": { [捲舌]: "an", "": "ien" },
            "合口": { [捲舌]: "uan", "": "yuen" },
          },
        },
        效攝: {
          三四等: { [捲舌]: "au", "": "iau" },
          二等: { "見影組": "iau", "": "au" },
          一等: "au",
        },
        果攝: {
          歌韻: { "開口 或 幫組": "o", "合口": "uo" },
          戈韻: { 開口: "ie", 合口: "yue" },
        },
        假攝: {
          二等: { "開口 或 幫組": { "見影組": "ia", "": "a" }, "合口": "ua" },
          三四等: { [捲舌]: "ae", "": "ie" },
        },
        宕攝: {
          一等: { 幫組: "ang", 開口: "ang", 合口: "uang" },
          三等: {
            幫組: "ang",
            開口: { "莊組": "uang", [捲舌]: "ang", "": "iang" },
            合口: "uang",
          },
        },
        梗曾攝: {
          一二等: { "開口 或 幫組": "eng", "合口": "ueng" },
          三四等: {
            "開口 或 幫組": { [捲舌]: "eng", "": "ing" },
            "合口": "iung",
          },
        },
        流攝: {
          三等: { [`${捲舌} 或 幫組 C類`]: "ou", "": "iu" },
          一等: "ou",
        },
        深攝: { [捲舌]: "em", "": "im" },
        咸攝: {
          覃韻: { "泥來母": "am", "": "om" },
          談韻: "am",
          鹽添咸嚴韻: { [捲舌]: "am", "": "iem" },
          銜韻: { [`${捲舌} 或 幫組`]: "am", "": "iem" },
          凡韻: { "幫組": "am", [捲舌]: "uam", "": "yuem" },
        },
      },

      入聲: {
        通攝: {
          一等: "uk",
          三等: { "莊章組 或 知徹澄日母 或 幫組": "uk", "": "yuk" },
        },
        江攝: { "幫組": "ok", "莊章組 或 知徹澄日母": "uok", "": "iok" },
        臻攝: {
          真韻: {
            "開口 或 幫組": { [捲舌]: "rt", "": "it" },
            "合口": { [捲舌]: "ut", "": "yut" },
          },
          臻殷韻: { [捲舌]: "rt", "": "it" },
          文韻: { "幫組": "ut", "見影組 或 孃母": "yuet", "": "yut" },
          痕韻: "et",
          魂韻: "ut", // 有異讀
        },
        山攝: {
          寒韻: { "開口": { "精端組 或 來母": "at", "": "ot" }, "合口 或 幫組": "uot" },
          刪山韻: {
            "開口 或 幫組": { "見影組 或 孃母": "iat", "": "at" },
            "合口": "uat",
          },
          元韻: {
            "開口": "iet",
            "合口 或 幫組": { "幫組": "at", "": "yuet" },
          },
          先韻: {
            "開口 或 幫組": "iet",
            "合口": { [捲舌]: "ut", "": "yuet" },
          },
          仙韻: {
            "開口 或 幫組": { [捲舌]: "aet", "": "iet" },
            "合口": { [捲舌]: "uot", "": "yuet" },
          },
        },
        宕攝: {
          一等: { "開口 或 幫組": "ok", "合口": "uok" },
          三等: {
            幫組: "ok",
            開口: { [捲舌]: "ok", "": "iok" },
            合口: "yuok",
          },
        },
        梗攝: {
          二等: { "開口 或 幫組": "ek", "合口": "uok" },
          三四等: {
            "開口 或 幫組": { [捲舌]: "rk", "": "ik" },
            "合口": { [捲舌]: "uk", "": "yuk" },
          },
        },
        曾攝: {
          三等: {
            "章組": "rk",
            "開口 或 幫組": { [捲舌]: "ek", "": "ik" },
            "合口": "yuk",
          },
          一等: { "開口 或 幫組": "ek", "合口": "uok" },
        },
        深攝: { "章組": "rp", [捲舌]: "ep", "": "ip" },
        咸攝: {
          覃韻: { "泥來母": "ap", "": "op" },
          談韻: "ap",
          鹽添嚴韻: { [捲舌]: "ep", "": "iep" },
          咸銜韻: { [`${捲舌} 或 幫組`]: "ap", "": "iap" },
          凡韻: { "幫組": "ap", [捲舌]: "uap", "": "yuep" },
        },
      },
    }),
  );
}

function getTone() {
  return when(
    format({
      清音: {
        平聲: 1,
        上聲: 3,
        去聲: 4,
        入聲: 5,
      },
      濁音: {
        平聲: 2,
        上聲: { 全濁: 4, 次濁: 3 },
        去聲: 4,
        入聲: 6,
      },
    }),
  );
}

let initial = getInitial();
let final = getFinal();
let tone = getTone();

let ret = initial + final;

function nml(ret) {
  const rules = [
    [/^ngi/, "nji"],
    [/^ngyu/, "njyu"],
    [/^nj([aeou].)/, "ng$1"],
    [/^njy/, "ny"],
    [/^nji/, "nyi"],

    [/^gi/, "ji"],
    [/^ki/, "chi"],
    [/^hi/, "hsi"],
    [/^gy/, "jy"],
    [/^ky/, "chy"],
    [/^hy/, "hsy"],
    [/^gu([aeo])/, "gw$1"],
    [/^ku([aeo])/, "kw$1"],
    [/^hu([aeo])/, "hw$1"],
    [/^ngu([aeo])/, "ngw$1"],
    [/^r([aue])/, "rh$1"],
    [/^([bpmfv]?)ung$/, "$1ong"],

    [/^i$/, "yi"],
    [/^in$/, "yin"],
    [/^im$/, "yim"],
    [/^ing$/, "ying"],
    [/^ip$/, "yip"],
    [/^it$/, "yit"],
    [/^ik$/, "yik"],
    [/^i/, "y"],
    [/^u$/, "wu"],
    [/^ut$/, "wut"],
    [/^uk$/, "wuk"],
    [/^ung/, "ung"],
    [/^u/, "w"],
    ["rp", "ip"],
    ["rt", "it"],
    ["rk", "ik"],
  ];
  rules.forEach(([o, n]) => {
    ret = ret.replace(o, n);
  });
  return ret;
}

function nml2(ret) {
  return (
    {
      tzou: "tzow",
      tsou: "tsow",
      sou: "sow",
      zhou: "zhow",
      chou: "chow",
      shou: "show",
      rou: "row",
      buen: "bun",
      puen: "pun",
      muen: "mun",
      buei: "bui",
      puei: "pui",
      muei: "mui",
      rher: "er",
      tzz: "tz",
      yu: "you",
    }[ret] ?? ret
  );
}

// noinspection JSAnnotator
return nml2(nml(ret)) + tone;
