export type Modification = (a: string) => string;

function modify(initialKey: string, finalKey: string, toneKey: string): Modification {
  // eslint-disable-next-line @typescript-eslint/ban-ts-comment
  // @ts-expect-error
  return () => window["shared"]["build"](initialKey, finalKey, toneKey);
}

export const MODIFICATIONS = new Map<string, (string | Modification)[][]>([
  ["们", [["明一魂平", modify("M", "UEN", "輕")]]],
  ["們", [["明一魂平", modify("M", "UEN", "輕")]]],
  ["哈", [["曉開一歌平", modify("H", "A", "輕")]]],
  ["嚕", [["曉開一歌平", modify("L", "U", "輕")]]],
  ["噜", [["曉開一歌平", modify("L", "U", "輕")]]],
  ["他", [["透開一歌平", it => it.replace("o", "a")]]],
  ["她", [["透開一歌平", it => it.replace("o", "a")]]],
  ["它", [["透開一歌平", it => it.replace("o", "a")]]],
  ["那", [["泥開一歌去", it => it.replace("o", "a")]]],
  ["哪", [["泥開一歌上", it => it.replace("o", "a")]]],
  ["什", [["常開三侵平", it => it.replace("ch", "sh")]]],
  ["甚", [["常開三侵平", it => it.replace("ch", "sh")]]],
  ["時", [["常開三之平", it => it.replace("ch", "sh")]]],
  ["打", [["端開二庚上", it => it.replace("eng", "a")]]],
  ["怎", [["章開三侵上", it => it.replace("zh", "tz")]]],
  ["完", [["影合二刪平", it => it.replace("hw", "w").replace("1", "2")]]],
  ["丸", [["影合二刪平", it => it.replace("hw", "w").replace("1", "2")]]],
]);
// MODIFICATIONS.set("们", [["明一魂平", () => "men"]]);

export const ADDITIONS = new Map<string, string[][]>([
  ["们", [["明一魂平", "用在人称代词或指人的名词后面，表示复数"]]],
  ["們", [["明一魂平", "用在人称代词或指人的名词后面，表示复数"]]],
  ["哈", [["曉開一歌平", "張口舒氣；形容笑聲；姓"]]],
  ["擼", [["來一模平", "捋、用手抓住東西的某一部分，向別的部分移動壓取"]]],
  ["撸", [["來一模平", "捋、用手抓住東西的某一部分，向別的部分移動壓取"]]],
  ["咚", [["端一冬平", "模擬撞擊或敲鼓的聲音"]]],
  ["嚕", [["來一模平", "語氣詞"]]],
  ["噜", [["來一模平", "語氣詞"]]],
  ["不", [["並一魂入", "與弗同，表否定"]]],
  ["他", [["透開一歌平", "代词，指人"]]],
  ["她", [["透開一歌平", "代词，指女性"]]],
  ["它", [["透開一歌平", "代词，专指人以外的事物"]]],
  ["那", [["泥開一歌去", "代词 指示比较远的人和事物，同“这”相对"]]],
  ["哪", [["泥開一歌上", "代词 表示疑问或虛指"]]],
  ["卡", [["溪開二麻上", "夹在中间，不能活动"]]],
  ["話", [["匣合二麻去", "言語"]]],
  ["话", [["匣合二麻去", "言語"]]],
  ["这", [["章開三麻去", "代词 指代较近的时间、地方或事物"]]],
  ["這", [["章開三麻去", "代词 指代较近的时间、地方或事物"]]],
  ["什", [["常開三侵平", "【正確形式：甚麽】代词 表示疑问"]]],
  ["甚", [["常開三侵平", "代词 表示疑问"]]],
  ["時", [["常開三之平", "時辰"]]],
  // ["给", [["見開三B侵入", "交付；送与"]]],
  // ["給", [["見開三B侵入", "交付；送与"]]],
  ["打", [["端開二庚上", "撞击；敲打"]]],
  ["最", [["精合三脂去", "居于首要"]]],
  ["怎", [["章開三侵上", "代词 表示疑问"]]],
  ["做", [["精開一歌去", "制作；创作"]]],
  ["完", [["影合二刪平", "完結、全部"]]],
  ["丸", [["影合二刪平", "圓團"]]],
  ["擦", [["清開一寒入", "擦拭"]]],
]);
